README.org
* synopsis
node js/stepA_mal.js js/tests/stepA_mal.mal   # original mal test; will work unconditionally
node js/temacs-24.5.js js/stepA_mal.mal       # continuously incoporating loadup gradually
node js/temacs-24.5.js js/loadup.el           # benchmark; shall work finally

此一指令將載入 emacs 預載的 loadup.el 並進行 sanity check ，驗證 temacs 的完成度。

接下來的工作，將分為兩個方向進行。 從 mal 方找尋 emacs 方的對應元素，以及從 emacs 的執行期行為找尋對應的程式以決定實作的優先順序。

* 從 emacs 的執行期行為找尋對應的程式碼
程式執行開頭頭有顯示一個 splash 畫面，我們將從此畫面的元素著手，得到初始載入順序相關資訊。

startup.el 是第一個被載入執行的 lisp 檔案。 經分析後發現此一行為由 Makefile.in 所指定。

** building
*** bare emacs: Emacs Lisp interpreter and I/O routines
 [[bookmark:temacs][Bookmark: temacs]]

 在建置 emacs 的過程中，第一步為產生此一空殼 temacs 

*** dumped (pure) Emacs: set up the normal Emacs editing environment

 [[bookmark:dumped%20Emacs][Bookmark: dumped Emacs]]

 c.f. 末傾印，只進行 "拔靴法(Bootstrap)" 
 [[bookmark:bootstrap-emacs][Bookmark: bootstrap-emacs]]

 在建置 emacs 的過程中，第二步為產生此一 "dumped Emacs" 的預載映象檔；其 --load 參數指定了 loadup.el 這個預載檔案；其中 loadup.el 會再指定預載檔案
**** load "startup"
 [[bookmark:load%20"startup"][Bookmark: load "startup"]]

 在此檔末端並指定執行 startup.el 中的 top-level 函數，也就是 normal-top-level。 

startup.el 有特定的字串，似乎與視窗介面的建立有關。

其它載入檔案如下：

 (load "emacs-lisp/byte-run")
 (load "emacs-lisp/backquote")
 (load "subr")
 (load "version")
 (load "widget")
 (load "custom")
 (load "emacs-lisp/map-ynp")
 (load "international/mule")
 (load "international/mule-conf")
 (load "env")
 (load "format")
 (load "bindings")
 (load "cus-start")
 (load "window")  ; Needed here for `replace-buffer-in-windows'.
 (load "files")
 (load "emacs-lisp/macroexp")
     (load "emacs-lisp/pcase"))
   (load "emacs-lisp/macroexp"))
 (load "cus-face")
 (load "faces")  ; after here, `defface' may be used.
 (load "button")

 (load "startup")

     (load "loaddefs.el")
   (file-error (load "ldefs-boot.el")))
 (load "emacs-lisp/nadvice")
 (load "minibuffer")
 (load "abbrev")         ;lisp-mode.el and simple.el use define-abbrev-table.
 (load "simple")
 (load "help")
 (load "jka-cmpr-hook")
 (load "epa-hook")
 (load "international/mule-cmds")
 (load "case-table")
 (load "international/charprop.el" t)
 (load "international/characters")
 (load "composite")
 (load "language/chinese")
 (load "language/cyrillic")
 (load "language/indian")
 (load "language/sinhala")
 (load "language/english")
 (load "language/ethiopic")
 (load "language/european")
 (load "language/czech")
 (load "language/slovak")
 (load "language/romanian")
 (load "language/greek")
 (load "language/hebrew")
 (load "language/japanese")
 (load "language/korean")
 (load "language/lao")
 (load "language/tai-viet")
 (load "language/thai")
 (load "language/tibetan")
 (load "language/vietnamese")
 (load "language/misc-lang")
 (load "language/utf-8-lang")
 (load "language/georgian")
 (load "language/khmer")
 (load "language/burmese")
 (load "language/cham")
 (load "indent")
 (load "frame")
 (load "term/tty-colors")
 (load "font-core")
 (load "facemenu")
 (load "emacs-lisp/syntax")
 (load "font-lock")
 (load "jit-lock")
       (load "mouse")
	    (load "scroll-bar"))
       (load "select")))
 (load "emacs-lisp/timer")
 (load "isearch")
 (load "rfn-eshadow")
 (load "menu-bar")
 (load "emacs-lisp/lisp")
 (load "textmodes/page")
 (load "register")
 (load "textmodes/paragraphs")
 (load "progmodes/prog-mode")
 (load "emacs-lisp/lisp-mode")
 (load "textmodes/text-mode")
 (load "textmodes/fill")
 (load "newcomment")
 (load "replace")
 (load "emacs-lisp/tabulated-list")
 (load "buff-menu")
       (load "fringe")
       (load "emacs-lisp/regexp-opt")
       (load "image")
       (load "international/fontset")
       (load "dnd")
       (load "tool-bar")))
     (load "dynamic-setting"))
       (load "x-dnd")
       (load "term/common-win")
       (load "term/x-win")))
       (load "term/common-win")
       (load "w32-vars")
       (load "term/w32-win")
       (load "disp-table")
       (load "w32-common-fns")
         (load "w32-fns")
         (load "ls-lisp")
         (load "dos-w32"))))
       (load "dos-w32")
       (load "dos-fns")
       (load "dos-vars")
       (load "term/internal")
       (load "term/pc-win")
       (load "ls-lisp")
       (load "disp-table"))) ; needed to setup ibm-pc char set, see internal.el
       (load "term/common-win")
       (load "term/ns-win")))
     (load "mwheel"))
 (load "emacs-lisp/float-sup")
 (load "vc/vc-hooks")
 (load "vc/ediff-hook")
 (load "uniquify")
 (load "electric")
 (if (not (eq system-type 'ms-dos)) (load "tooltip"))
 (load "leim/leim-list.el" t)
   (load "site-load" t)
   (load "site-init" t)
*** daily emacs, finally
 [[bookmark:Unless%20next%20switch%20is%20-nl,%20load%20"loadup.el"%20first%20thing.][Bookmark: Unless next switch is -nl, load "loadup.el" first thing.]]

 Unless next switch is -nl, load "loadup.el" first thing.
** running


*** 初始化@main()@emacs.c: initXXX & syms_of_XXX (defsubr, DEFVAR & DEFSYM)

**** init_obarray (object array = Vobarray)
[[bookmark:init_obarray%20(void)][Bookmark: init_obarray (void)]]

obarray 就是 object array 的意思，object 的型態都是 Lisp_Object

initial_obarray 是最初始的物件陣列，包含了最開始的三個常量： Qt, Qnil, Qunbound

最陽春的符號就是 Qt ，其定義代表最低要求 intern_c_string & SET_SYMBOL_VAL
***** Qt: "t"
****** Qt = intern_c_string ("t");
****** SET_SYMBOL_VAL (XSYMBOL (Qt), Qt);
****** XSYMBOL (Qt)->constant = 1;

