README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-02-17 Wed 18:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sigmund Tzeng" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. synopsis</a></li>
<li><a href="#orgheadline57">2. 從 emacs 的執行期行為找尋對應的程式碼</a>
<ul>
<li><a href="#orgheadline6">2.1. building</a>
<ul>
<li><a href="#orgheadline2">2.1.1. bare emacs: Emacs Lisp interpreter and I/O routines</a></li>
<li><a href="#orgheadline4">2.1.2. dumped (pure) Emacs: set up the normal Emacs editing environment</a></li>
<li><a href="#orgheadline5">2.1.3. daily emacs, finally</a></li>
</ul>
</li>
<li><a href="#orgheadline56">2.2. running</a>
<ul>
<li><a href="#orgheadline27">2.2.1. 初始化@main()@emacs.c: initXXX &amp; syms<sub>of</sub><sub>XXX</sub> (defsubr, DEFVAR &amp; DEFSYM)</a></li>
<li><a href="#orgheadline32">2.2.2. C / Lisp 兩用函數的宣告/定義及登錄： DEFUN (&amp; defsubr) @syms<sub>of</sub><sub>XXX</sub>（）</a></li>
<li><a href="#orgheadline35">2.2.3. 為何沒有DEFCONST?DEFSYM的作用？</a></li>
<li><a href="#orgheadline55">2.2.4. REPL</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline81">3. 從 mal 方找尋 emacs 方的對應元素</a>
<ul>
<li><a href="#orgheadline58">3.1. repl<sub>env</sub> =&gt; Vobarray</a></li>
<li><a href="#orgheadline62">3.2. equal</a>
<ul>
<li><a href="#orgheadline59">3.2.1. emacs implementation</a></li>
<li><a href="#orgheadline60">3.2.2. mal implementation</a></li>
<li><a href="#orgheadline61">3.2.3. 小結:  DEFUN/defsubr -&gt; core.ns</a></li>
</ul>
</li>
<li><a href="#orgheadline68">3.3. let* / let</a>
<ul>
<li><a href="#orgheadline65">3.3.1. emacs:</a></li>
<li><a href="#orgheadline66">3.3.2. mal:</a></li>
<li><a href="#orgheadline67">3.3.3. 小結： DEFVAR =&gt; init<sub>XXXX</sub></a></li>
</ul>
</li>
<li><a href="#orgheadline71">3.4. load-path 的初始化</a>
<ul>
<li><a href="#orgheadline69">3.4.1. emacs</a></li>
<li><a href="#orgheadline70">3.4.2. mal</a></li>
</ul>
</li>
<li><a href="#orgheadline74">3.5. or</a>
<ul>
<li><a href="#orgheadline72">3.5.1. mal implementation</a></li>
<li><a href="#orgheadline73">3.5.2. emacs implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline75">3.6. def! / set / setq</a></li>
<li><a href="#orgheadline78">3.7. if</a>
<ul>
<li><a href="#orgheadline76">3.7.1. mal implementation</a></li>
<li><a href="#orgheadline77">3.7.2. emacs implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline79">3.8. macroexpand</a></li>
<li><a href="#orgheadline80">3.9. try*/catch*</a></li>
</ul>
</li>
<li><a href="#orgheadline82">4. 推估應預載模組</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> synopsis</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">node js/temacs-24.5.js js/loadup_1.el         # first list; working!!
node js/temacs-24.5.js js/loadup.el           # benchmark; shall work finally
</pre>
</div>
<p>
以上指令將載入 emacs 預載的 loadup.el 並進行 sanity check ，驗證 temacs 的完成度。
</p>

<p>
接下來的工作，將分為兩個方向進行。 從 mal 方找尋 emacs 方的對應元素，以及從 emacs 的執行期行為找尋對應的程式以決定實作的優先順序。
</p>
</div>
</div>

<div id="outline-container-orgheadline57" class="outline-2">
<h2 id="orgheadline57"><span class="section-number-2">2</span> 從 emacs 的執行期行為找尋對應的程式碼</h2>
<div class="outline-text-2" id="text-2">
<p>
程式執行開頭頭有顯示一個 splash 畫面，我們將從此畫面的元素著手，得到初始載入順序相關資訊。
</p>

<p>
startup.el 是第一個被載入執行的 lisp 檔案。 經分析後發現此一行為由 Makefile.in 所指定。
</p>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> building</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">2.1.1</span> bare emacs: Emacs Lisp interpreter and I/O routines</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<a href="temacs">Bookmark: temacs</a>
</p>

<p>
在建置 emacs 的過程中，第一步為產生此一空殼 temacs 
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">2.1.2</span> dumped (pure) Emacs: set up the normal Emacs editing environment</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<a href="dumped%20Emacs">Bookmark: dumped Emacs</a>
</p>

<p>
c.f. 末傾印，只進行 "拔靴法(Bootstrap)" 
<a href="bootstrap-emacs">Bookmark: bootstrap-emacs</a>
</p>

<p>
在建置 emacs 的過程中，第二步為產生此一 "dumped Emacs" 的預載映象檔；其 &#x2013;load 參數指定了 loadup.el 這個預載檔案；其中 loadup.el 會再指定預載檔案
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline3"></a>load "startup"<br  /><div class="outline-text-5" id="text-2-1-2-1">
<p>
<a href="load%20"startup"">Bookmark: load "startup"</a>
</p>

<p>
在此檔末端並指定執行 startup.el 中的 top-level 函數，也就是 normal-top-level。 
</p>

<p>
startup.el 有特定的字串，似乎與視窗介面的建立有關。
</p>

<p>
其它載入檔案如下：
</p>

<p>
(load "emacs-lisp/byte-run")
(load "emacs-lisp/backquote")
(load "subr")
(load "version")
(load "widget")
(load "custom")
(load "emacs-lisp/map-ynp")
(load "international/mule")
(load "international/mule-conf")
(load "env")
(load "format")
(load "bindings")
(load "cus-start")
(load "window")  ; Needed here for `replace-buffer-in-windows'.
(load "files")
(load "emacs-lisp/macroexp")
    (load "emacs-lisp/pcase"))
  (load "emacs-lisp/macroexp"))
(load "cus-face")
(load "faces")  ; after here, `defface' may be used.
(load "button")
</p>

<p>
(load "startup")
</p>

<p>
    (load "loaddefs.el")
  (file-error (load "ldefs-boot.el")))
(load "emacs-lisp/nadvice")
(load "minibuffer")
(load "abbrev")         ;lisp-mode.el and simple.el use define-abbrev-table.
(load "simple")
(load "help")
(load "jka-cmpr-hook")
(load "epa-hook")
(load "international/mule-cmds")
(load "case-table")
(load "international/charprop.el" t)
(load "international/characters")
(load "composite")
(load "language/chinese")
(load "language/cyrillic")
(load "language/indian")
(load "language/sinhala")
(load "language/english")
(load "language/ethiopic")
(load "language/european")
(load "language/czech")
(load "language/slovak")
(load "language/romanian")
(load "language/greek")
(load "language/hebrew")
(load "language/japanese")
(load "language/korean")
(load "language/lao")
(load "language/tai-viet")
(load "language/thai")
(load "language/tibetan")
(load "language/vietnamese")
(load "language/misc-lang")
(load "language/utf-8-lang")
(load "language/georgian")
(load "language/khmer")
(load "language/burmese")
(load "language/cham")
(load "indent")
(load "frame")
(load "term/tty-colors")
(load "font-core")
(load "facemenu")
(load "emacs-lisp/syntax")
(load "font-lock")
(load "jit-lock")
      (load "mouse")
           (load "scroll-bar"))
      (load "select")))
(load "emacs-lisp/timer")
(load "isearch")
(load "rfn-eshadow")
(load "menu-bar")
(load "emacs-lisp/lisp")
(load "textmodes/page")
(load "register")
(load "textmodes/paragraphs")
(load "progmodes/prog-mode")
(load "emacs-lisp/lisp-mode")
(load "textmodes/text-mode")
(load "textmodes/fill")
(load "newcomment")
(load "replace")
(load "emacs-lisp/tabulated-list")
(load "buff-menu")
      (load "fringe")
      (load "emacs-lisp/regexp-opt")
      (load "image")
      (load "international/fontset")
      (load "dnd")
      (load "tool-bar")))
    (load "dynamic-setting"))
      (load "x-dnd")
      (load "term/common-win")
      (load "term/x-win")))
      (load "term/common-win")
      (load "w32-vars")
      (load "term/w32-win")
      (load "disp-table")
      (load "w32-common-fns")
        (load "w32-fns")
        (load "ls-lisp")
        (load "dos-w32"))))
      (load "dos-w32")
      (load "dos-fns")
      (load "dos-vars")
      (load "term/internal")
      (load "term/pc-win")
      (load "ls-lisp")
      (load "disp-table"))) ; needed to setup ibm-pc char set, see internal.el
      (load "term/common-win")
      (load "term/ns-win")))
    (load "mwheel"))
(load "emacs-lisp/float-sup")
(load "vc/vc-hooks")
(load "vc/ediff-hook")
(load "uniquify")
(load "electric")
(if (not (eq system-type 'ms-dos)) (load "tooltip"))
(load "leim/leim-list.el" t)
  (load "site-load" t)
  (load "site-init" t)
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.1.3</span> daily emacs, finally</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<a href="Unless%20next%20switch%20is%20-nl,%20load%20"loadup.el"%20first%20thing.">Bookmark: Unless next switch is -nl, load "loadup.el" first thing.</a>
</p>

<p>
Unless next switch is -nl, load "loadup.el" first thing.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">2.2</span> running</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">2.2.1</span> 初始化@main()@emacs.c: initXXX &amp; syms<sub>of</sub><sub>XXX</sub> (defsubr, DEFVAR &amp; DEFSYM)</h4>
<div class="outline-text-4" id="text-2-2-1">
</div><ol class="org-ol"><li><a id="orgheadline10"></a>init<sub>obarray</sub> (object array = Vobarray)<br  /><div class="outline-text-5" id="text-2-2-1-1">
<p>
<a href="init_obarray%20(void)">Bookmark: init<sub>obarray</sub> (void)</a>
</p>

<p>
obarray 就是 object array 的意思，object 的型態都是 Lisp<sub>Object</sub>
</p>

<p>
initial<sub>obarray</sub> 是最初始的物件陣列，包含了最開始的三個常量： Qt, Qnil, Qunbound
</p>

<p>
最陽春的符號就是 Qt ，其定義代表最低要求 intern<sub>c</sub><sub>string</sub> &amp; SET<sub>SYMBOL</sub><sub>VAL</sub>
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline7"></a>Qt: "t"<br  /><div class="outline-text-6" id="text-2-2-1-1-1">
<div class="org-src-container">

<pre class="src src-C">Qt = intern_c_string ("t");
SET_SYMBOL_VAL (XSYMBOL (Qt), Qt);
XSYMBOL (Qt)-&gt;constant = 1;
</pre>
</div>
</div></li>
