README.html


<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">2.2.3</span> 為何沒有DEFCONST?DEFSYM的作用？</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Symbols.html#Creating-Symbols">https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Symbols.html#Creating-Symbols</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline33"></a>func, subst, alias, macro<br  /></li>

<li><a id="orgheadline34"></a>var, const, custom<br  /></li></ol>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">2.2.4</span> REPL</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
在 main 函數中，呼叫了 Frecursive-edit ，這是事件處理迴圈的入口
</p>

<p>
<a href="Frecursive_edit%20();">Bookmark: Frecursive<sub>edit</sub> ();</a>
</p>

<p>
<a href="DEFUN%20("recursive-edit",%20Frecursive_edit,%20Srecursive_edit,%200,%200,%20"",">DEFUN ("recursive-edit", Frecursive<sub>edit</sub>, Srecursive<sub>edit</sub>, 0, 0, "",</a>
</p>

<p>
<a href="command_loop%20(void)">Bookmark: command<sub>loop</sub> (void)</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline53"></a>load "loadup.el" first thing<br  /><div class="outline-text-5" id="text-2-2-4-1">
<p>
在進入 Frecursive-edit 之前，已經塞了指令 load loadup.el 給最上層的環境：
</p>

<p>
<a href="Vtop_level%20=%20list2%20(intern_c_string%20("load"),">Bookmark: Vtop<sub>level</sub> = list2 (intern<sub>c</sub><sub>string</sub> ("load"),</a>
</p>

<p>
因此先討論整個 eval 的入口
</p>

<p>
<a href="internal_catch%20(Qtop_level,%20top_level_1,%20Qnil);">Bookmark: internal<sub>catch</sub> (Qtop<sub>level</sub>, top<sub>level</sub><sub>1</sub>, Qnil);</a>
</p>

<p>
<a href="top_level_1%20(Lisp_Object%20ignore)">Bookmark: top<sub>level</sub><sub>1</sub> (Lisp<sub>Object</sub> ignore)</a>
</p>

<p>
<a href="internal_condition_case%20(top_level_2,%20Qerror,%20cmd_error);">Bookmark: internal<sub>condition</sub><sub>case</sub> (top<sub>level</sub><sub>2</sub>, Qerror, cmd<sub>error</sub>);</a>
</p>

<p>
<a href="top_level_2%20(void)">Bookmark: top<sub>level</sub><sub>2</sub> (void)</a>
</p>

<p>
<a href="return%20Feval%20(Vtop_level,%20Qnil);">Bookmark: return Feval (Vtop<sub>level</sub>, Qnil);</a>
</p>

<p>
<a href="DEFUN%20("eval",%20Feval,%20Seval,%201,%202,%200,">Bookmark: DEFUN ("eval", Feval, Seval, 1, 2, 0,</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline36"></a>eval<sub>sub</sub><br  /><div class="outline-text-6" id="text-2-2-4-1-1">
<p>
<a href="return%20unbind_to%20(count,%20eval_sub%20(form));">Bookmark: return unbind<sub>to</sub> (count, eval<sub>sub</sub> (form));</a>
</p>

<p>
<a href="eval_sub%20(Lisp_Object%20form)">Bookmark: eval<sub>sub</sub> (Lisp<sub>Object</sub> form)</a>
</p>

<p>
此處呼叫了 list 的函數以進行求值
</p>
<div class="org-src-container">

<pre class="src src-C">switch (i)
  {
  case 0:
    val = (XSUBR (fun)-&gt;function.a0 ());
    break;
  case 1:
    val = (XSUBR (fun)-&gt;function.a1 (argvals[0]));
    break;
  case 2:
    val = (XSUBR (fun)-&gt;function.a2 (argvals[0], argvals[1]));
    break;
  case 3:
    val = (XSUBR (fun)-&gt;function.a3
	   (argvals[0], argvals[1], argvals[2]));
    break;
  case 4:
    val = (XSUBR (fun)-&gt;function.a4
	   (argvals[0], argvals[1], argvals[2], argvals[3]));
    break;
  case 5:
    val = (XSUBR (fun)-&gt;function.a5
	   (argvals[0], argvals[1], argvals[2], argvals[3],
	    argvals[4]));
    break;
  case 6:
    val = (XSUBR (fun)-&gt;function.a6
	   (argvals[0], argvals[1], argvals[2], argvals[3],
	    argvals[4], argvals[5]));
    break;
  case 7:
    val = (XSUBR (fun)-&gt;function.a7
	   (argvals[0], argvals[1], argvals[2], argvals[3],
	    argvals[4], argvals[5], argvals[6]));
    break;

  case 8:
    val = (XSUBR (fun)-&gt;function.a8
	   (argvals[0], argvals[1], argvals[2], argvals[3],
	    argvals[4], argvals[5], argvals[6], argvals[7]));
    break;

  default:
    /* Someone has created a subr that takes more arguments than
       is supported by this code.  We need to either rewrite the
       subr to use a different argument protocol, or add more
       cases to this switch.  */
    emacs_abort ();
  }
</pre>
</div>
</div></li>
<li><a id="orgheadline44"></a>Fload(): Execute a file of Lisp code named FILE.<br  /><div class="outline-text-6" id="text-2-2-4-1-2">
<p>
Fload() 雖然不是初級的語法元素，但是了解它的流程對測試有相當的幫助，因此以下說明它的執行流程
</p>

<p>
<a href="DEFUN%20("load",%20Fload,%20Sload,%201,%205,%200,">Bookmark: DEFUN ("load", Fload, Sload, 1, 5, 0,</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline43"></a>readevalloop<br  /><div class="outline-text-7" id="text-2-2-4-1-2-1">
<p>
<a href="readevalloop%20(Qget_file_char,%20stream,%20hist_file_name,">Bookmark: readevalloop (Qget<sub>file</sub><sub>char</sub>, stream, hist<sub>file</sub><sub>name</sub>,</a>
</p>

<p>
<a href="readevalloop%20(Lisp_Object%20readcharfun,">Bookmark: readevalloop (Lisp<sub>Object</sub> readcharfun,</a>
</p>

<p>
即然名為 ReadEval(Print)Loop = RE(P)L ，應該就會有個迴圈，進行讀取-&gt;求值。 
</p>

<p>
參數 stream 為所讀取檔案的 handle , 若為 nil 時表示由 stdin 讀取。
</p>

<p>
迴圈中以 READCHAR 來預讀一個字元，以判斷接下來的語法元素，並調用對應的函式
</p>

<p>
除了 read<sub>list</sub> 以外，其它函數都還滿 trivial 的，因此以下集中討論 read<sub>list</sub>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline37"></a>READCHAR<br  /><div class="outline-text-8" id="text-2-2-4-1-2-1-1">
<p>
<a href="c%20=%20READCHAR;">Bookmark: c = READCHAR;</a> 
</p>

<p>
#define READCHAR readchar (readcharfun, NULL)
</p>

<p>
<a href="static%20int%20readchar%20(Lisp_Object%20readcharfun,%20bool%20*multibyte)">Bookmark: static int readchar (Lisp<sub>Object</sub> readcharfun, bool *multibyte)</a>
</p>

<p>
/* When READCHARFUN is Qget<sub>file</sub><sub>char</sub>, Qget<sub>emacs</sub><sub>mule</sub><sub>file</sub><sub>char</sub>,
   Qlambda, or a cons, we use this to keep an unread character because
   a file stream can't handle multibyte-char unreading.  The value -1
   means that there's no unread character.  */
</p>
</div></li>

<li><a id="orgheadline40"></a>read<sub>list</sub><br  /><div class="outline-text-8" id="text-2-2-4-1-2-1-2">
<p>
<a href="val%20=%20read_list%20(0,%20readcharfun);">Bookmark: val = read<sub>list</sub> (0, readcharfun);</a>
</p>

<p>
<a href="static%20Lisp_Object%20read_list%20(bool%20flag,%20Lisp_Object%20readcharfun)">Bookmark: static Lisp<sub>Object</sub> read<sub>list</sub> (bool flag, Lisp<sub>Object</sub> readcharfun)</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline38"></a>read1<br  /><div class="outline-text-9" id="text-2-2-4-1-2-1-2-1">
<p>
<a href="elt%20=%20read1%20(readcharfun,%20&amp;ch,%20first_in_list);">Bookmark: elt = read1 (readcharfun, &amp;ch, first<sub>in</sub><sub>list</sub>);</a>
</p>

<p>
<a href="static%20Lisp_Object%20read1%20(Lisp_Object%20readcharfun,%20int%20*pch,%20bool%20first_in_list)">Bookmark: static Lisp<sub>Object</sub> read1 (Lisp<sub>Object</sub> readcharfun, int *pch, bool first<sub>in</sub><sub>list</sub>)</a>
</p>
</div></li>

<li><a id="orgheadline39"></a>Fintern<br  /><div class="outline-text-9" id="text-2-2-4-1-2-1-2-2">
<p>
<a href="result%20=%20(uninterned_symbol%20?%20Fmake_symbol%20(name)%20:%20Fintern%20(name,%20Qnil));">Bookmark: result = (uninterned<sub>symbol</sub> ? Fmake<sub>symbol</sub> (name) : Fintern (name, Qnil));</a>
</p>

<p>
<a href="DEFUN%20("intern",%20Fintern,%20Sintern,%201,%202,%200,">Bookmark: DEFUN ("intern", Fintern, Sintern, 1, 2, 0,</a>
</p>

<p>
/* Return the canonical symbol whose name is STRING.
If there is none, one is created by this function and returned.
A second optional argument specifies the obarray to use;
it defaults to the value of `Vobarray'.  */
</p>

<p>
此一函數做的事基本上就跟 intern<sub>c</sub><sub>string</sub><sub>1</sub>/intern<sub>c</sub><sub>string</sub> 一樣，查詢此一字串是否已定義為符號，並傳回之
</p>
</div></li></ol></li>

<li><a id="orgheadline41"></a>DEFUN ("macroexpand", Fmacroexpand, Smacroexpand, 1, 2, 0,<br  /><div class="outline-text-8" id="text-2-2-4-1-2-1-3">
<p>
<a href="DEFUN%20("macroexpand",%20Fmacroexpand,%20Smacroexpand,%201,%202,%200,">Bookmark: DEFUN ("macroexpand", Fmacroexpand, Smacroexpand, 1, 2, 0,</a>
</p>

<p>
這個部分我滿懷疑是不是寫錯了，似乎永遠不會執行到？？
</p>
</div></li>

<li><a id="orgheadline42"></a>eval<sub>sub</sub><br  /><div class="outline-text-8" id="text-2-2-4-1-2-1-4">
<p>
<a href="val%20=%20eval_sub%20(val);">Bookmark: val = eval<sub>sub</sub> (val);</a>
</p>

<p>
此後由於 read<sub>list</sub> 已經進行了實質上的 scanning ，而 emacs lisp 實質上就是 AST ，所以不需要 parsing
</p>

<p>
因此可以直接進行求值。
</p>
</div></li></ol></li></ol></li>
<li><a id="orgheadline52"></a>emacs lisp key syntax elements in eval.c<br  /><div class="outline-text-6" id="text-2-2-4-1-3">
<p>
<a href="syms_of_eval%20(void)">Bookmark: syms<sub>of</sub><sub>eval</sub> (void)</a>
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline45"></a>conditionals<br  /><div class="outline-text-7" id="text-2-2-4-1-3-1">
<p>
defsubr (&amp;Sor);
defsubr (&amp;Sand);
defsubr (&amp;Sif);
defsubr (&amp;Scond);
</p>
</div></li>
