README.org
****** var
   defsubr (&Ssetq);
   defsubr (&Squote);
   defsubr (&Sfunction);
   defsubr (&Sdefault_toplevel_value);
   defsubr (&Sset_default_toplevel_value);
   defsubr (&Sdefvar);
   defsubr (&Sdefvaralias);
   defsubr (&Sdefconst);
   defsubr (&Smake_var_non_special);
   defsubr (&Slet);
   defsubr (&SletX);

****** macro
   defsubr (&Swhile);
   defsubr (&Smacroexpand);

****** exception
   defsubr (&Scatch);
   defsubr (&Sthrow);
   defsubr (&Sunwind_protect);

****** flow
   defsubr (&Scondition_case);
   defsubr (&Ssignal);
   defsubr (&Scommandp);
   defsubr (&Sautoload);
   defsubr (&Sautoload_do_load);
   defsubr (&Seval);
   defsubr (&Sapply);
   defsubr (&Sfuncall);

****** misc
   defsubr (&Srun_hooks);
   defsubr (&Srun_hook_with_args);
   defsubr (&Srun_hook_with_args_until_success);
   defsubr (&Srun_hook_with_args_until_failure);
   defsubr (&Srun_hook_wrapped);
   defsubr (&Sfetch_bytecode);
   defsubr (&Sbacktrace_debug);
   defsubr (&Sbacktrace);
   defsubr (&Sbacktrace_frame);
   defsubr (&Sbacktrace_eval);
   defsubr (&Sbacktrace__locals);
   defsubr (&Sspecial_variable_p);
   defsubr (&Sfunctionp);

**** UI
以下部分屬於使用者互動，在 repl 的層級暫不討論

 [[bookmark:command_loop_2%20(Lisp_Object%20ignore)][Bookmark: command_loop_2 (Lisp_Object ignore)]]

 [[bookmark:internal_condition_case%20(command_loop_1,%20Qerror,%20cmd_error);][Bookmark: internal_condition_case (command_loop_1, Qerror, cmd_error);]]




* 從 mal 方找尋 emacs 方的對應元素

** repl_env => Vobarray
mal 在初始化的過程中，把 core.ns 的內容複製到了 repl_env 當中，因此 repl_env 才是真正意義上存放所有 symboe 的物件，core.ns 則類似於 initial_obarray
** eval
嘗試載入 loadup.el 的過程中，第一個遇到的問題就是找不到這個算子。這個問題倒是好解決，因為 mal 本身已經定義了 "=" 算子；不過這倒是提供我們再一次審視 scanning / parsing 的流程

*** mal implementation
core.js 中有如下定義：

[[bookmark:var%20ns%20=%20{'type':%20types._obj_type,%20'=':%20types._equal_Q,][Bookmark: var ns = {'type': types._obj_type, '=': types._equal_Q,]]

因此符號的代表字串 '=' ，以及對應的函數 _equal_Q ，做為 hash 的一筆資料而存在於 ns 中

stepA_mal.js 中有如下定義：

[[bookmark:for%20(var%20n%20in%20core.ns)%20{%20repl_env.set(types._symbol(n),%20core.ns%5Bn%5D);%20}][Bookmark: for (var n in core.ns) { repl_env.set(types._symbol(n), core.ns{n}); }]]

ns 的資料再被逐筆的複製到 repl_env 中
*** emacs implementation
fns.c  中有如下定義：

[[bookmark:DEFUN%20("equal",%20Fequal,%20Sequal,%202,%202,%200,][Bookmark: DEFUN ("equal", Fequal, Sequal, 2, 2, 0,]]

[[bookmark:%20%20defsubr%20(&Sequal);][Bookmark:   defsubr (&Sequal);]]
*** 小結:  DEFUN/defsubr -> core.ns
** let* / DEFVAR / let
DEFVAR 的作用似乎是直接在 global 的 symbol table 中寫入一筆資料，作用比較單純

Note that there are plenty of ways to make (GLOBAL) bindings: ‘defconst’, ‘defun’, ‘defvar’, 'let', ‘flet’, ‘labels’, ‘prog’, etc.

根據 [[https://www.emacswiki.org/emacs/DynamicBindingVsLexicalBinding][此文]] , emacs 只有 dynamic binding ，也就是說所有符號共用一個資料結構來存放 ， 使得內層的函數/迴圈可以影響外層符號，不管這個符號背後是變數或函數。

根據這樣的邏輯，dynamic binding (ie emacs lisp) 在局部變數宣告時， 會先查找環境是否有同名的符號，若然則直接使用它，不在自己的 scope 再定義自己的符號； lexical binding (scheme?) 則無論如何都直接在自己的環境中， 為局部變數定義符號，並且優先查找。

let* 與 let 的不同之處在於，let 的 value 會在與 key 作 binding 前先求值， 因此當 local / global 有同名變數時， 會優先取 global 的值。

更精確的來說， let 會比 let* 多一個迴圈，先對所有的 value 進行 eval 
*** specbind

*** emacs implementation
**** DEFVAR
***** DEFVAR_LISP @ lread.c
  [[bookmark:DEFVAR_LISP%20("command-line-args",%20Vcommand_line_args,][Bookmark: DEFVAR_LISP ("command-line-args", Vcommand_line_args,]]

  [[bookmark:#define%20DEFVAR_LISP(lname,%20vname,%20doc)][Bookmark: #define DEFVAR_LISP(lname, vname, doc)]]

  /* Macros we use to define forwarded Lisp variables.
     These are used in the syms_of_FILENAME functions.

     An ordinary (not in buffer_defaults, per-buffer, or per-keyboard)
     lisp variable is actually a field in `struct emacs_globals'.  The
     field's name begins with "f_", which is a convention enforced by
     these macros.  Each such global has a corresponding #define in
     globals.h; the plain name should be used in the code.

     E.g., the global "cons_cells_consed" is declared as "int
     f_cons_cells_consed" in globals.h, but there is a define:

	#define cons_cells_consed globals.f_cons_cells_consed

     All C code uses the `cons_cells_consed' name.  This is all done
     this way to support indirection for multi-threaded Emacs.  */

  #define DEFVAR_LISP(lname, vname, doc)		\
    do {						\
      static struct Lisp_Objfwd o_fwd;		\
      defvar_lisp (&o_fwd, lname, &globals.f_ ## vname);		\
    } while (false)

  在執行最開始的 make 的過程中，所有 DEFVAR 的 vname 會被收集到 globals.h 當中， 成為 emacs_globasl 的一個欄位， 名稱會加上前綴 f_ , 然後又被巨集宣告為與 lname 同名的變數。
***** defvar_lisp @ lread.c
  由以下程式碼可看出，這些變數會存到 staticvec 這個陣列中。 與 defsubr 的作法類似， 此變數的名稱會被註冊為一符號，並以 obarray 存放，方便以變數名查詢符號。 符號再經 SET_SYMBOL_FWD 存放此一變數的指標。

  [[bookmark:defvar_lisp%20(struct%20Lisp_Objfwd%20*o_fwd,][Bookmark: defvar_lisp (struct Lisp_Objfwd *o_fwd,]]

  /* Similar but define a variable whose value is the Lisp Object stored
     at address.  Two versions: with and without gc-marking of the C
     variable.  The nopro version is used when that variable will be
     gc-marked for some other reason, since marking the same slot twice
     can cause trouble with strings.  */
  void
  defvar_lisp_nopro (struct Lisp_Objfwd *o_fwd,
		     const char *namestring, Lisp_Object *address)
  {
    Lisp_Object sym;
    sym = intern_c_string (namestring);
    o_fwd->type = Lisp_Fwd_Obj;
    o_fwd->objvar = address;
    XSYMBOL (sym)->declared_special = 1;
    XSYMBOL (sym)->redirect = SYMBOL_FORWARDED;
    SET_SYMBOL_FWD (XSYMBOL (sym), (union Lisp_Fwd *)o_fwd);
  }

  void
  defvar_lisp (struct Lisp_Objfwd *o_fwd,
	       const char *namestring, Lisp_Object *address)
  {
    defvar_lisp_nopro (o_fwd, namestring, address);
    staticpro (address);
  }
***** staticpro: garbage collection
  [[bookmark:staticpro%20(Lisp_Object%20*varaddress)][Bookmark: staticpro (Lisp_Object *varaddress)]]

  /***********************************************************************
			    Protection from GC
   ***********************************************************************/

  /* Put an entry in staticvec, pointing at the variable with address
     VARADDRESS.  */

  void
  staticpro (Lisp_Object *varaddress)
  {
    if (staticidx >= NSTATICS)
      fatal ("NSTATICS too small; try increasing and recompiling Emacs.");
    staticvec[staticidx++] = varaddress;
  }
***** SET_SYMBOL_FWD
 [[bookmark:SET_SYMBOL_FWD%20(struct%20Lisp_Symbol%20*sym,%20union%20Lisp_Fwd%20*v)][Bookmark: SET_SYMBOL_FWD (struct Lisp_Symbol *sym, union Lisp_Fwd *v)]]

 INLINE void
 SET_SYMBOL_FWD (struct Lisp_Symbol *sym, union Lisp_Fwd *v)
 {
   eassert (sym->redirect == SYMBOL_FORWARDED);
   sym->val.fwd = v;
 }
***** SYMBOL_FORWARDED 影響到的函數
****** specbind
 特重要！！！ lisp 中的這些函數也需要它： let, 以及因為實質上使用了 let 而以 C 改寫的函數
****** 其它
******* buffer_local_value_1
  /* Return the value of VARIABLE in BUFFER.
  If VARIABLE does not have a buffer-local binding in BUFFER, the value
  is the default binding of the variable. */
******* store_frame_param
******* mark_object

***** staticvec: 與 GC 有關，不重要

**** let


*** mal: let* / def!
最外層的環境為 repl_env ，也就是 DEFUN / DEFVAR / DEFCONST 的作用域


*** 小結： DEFVAR_XXX
共 738 個
** def! / set / setq
** if
*** mal implementation
[[bookmark:case%20"if":][Bookmark: case "if":]]
*** emacs implementation
[[bookmark:DEFUN%20("if",%20Fif,%20Sif,%202,%20UNEVALLED,%200,][Bookmark: DEFUN ("if", Fif, Sif, 2, UNEVALLED, 0,]]

[[bookmark:defsubr%20(&Sif);][Bookmark: defsubr (&Sif);]]
** or
