README.html

<li><a id="orgheadline46"></a>blocks<br  /><div class="outline-text-7" id="text-2-2-4-1-3-2">
<p>
defsubr (&amp;Sprogn);
defsubr (&amp;Sprog1);
defsubr (&amp;Sprog2);
</p>
</div></li>

<li><a id="orgheadline47"></a>var<br  /><div class="outline-text-7" id="text-2-2-4-1-3-3">
<p>
defsubr (&amp;Ssetq);
defsubr (&amp;Squote);
defsubr (&amp;Sfunction);
defsubr (&amp;Sdefault<sub>toplevel</sub><sub>value</sub>);
defsubr (&amp;Sset<sub>default</sub><sub>toplevel</sub><sub>value</sub>);
defsubr (&amp;Sdefvar);
defsubr (&amp;Sdefvaralias);
defsubr (&amp;Sdefconst);
defsubr (&amp;Smake<sub>var</sub><sub>non</sub><sub>special</sub>);
defsubr (&amp;Slet);
defsubr (&amp;SletX);
</p>
</div></li>

<li><a id="orgheadline48"></a>macro<br  /><div class="outline-text-7" id="text-2-2-4-1-3-4">
<p>
defsubr (&amp;Swhile);
defsubr (&amp;Smacroexpand);
</p>
</div></li>

<li><a id="orgheadline49"></a>exception<br  /><div class="outline-text-7" id="text-2-2-4-1-3-5">
<p>
defsubr (&amp;Scatch);
defsubr (&amp;Sthrow);
defsubr (&amp;Sunwind<sub>protect</sub>);
</p>
</div></li>

<li><a id="orgheadline50"></a>flow<br  /><div class="outline-text-7" id="text-2-2-4-1-3-6">
<p>
defsubr (&amp;Scondition<sub>case</sub>);
defsubr (&amp;Ssignal);
defsubr (&amp;Scommandp);
defsubr (&amp;Sautoload);
defsubr (&amp;Sautoload<sub>do</sub><sub>load</sub>);
defsubr (&amp;Seval);
defsubr (&amp;Sapply);
defsubr (&amp;Sfuncall);
</p>
</div></li>

<li><a id="orgheadline51"></a>misc<br  /><div class="outline-text-7" id="text-2-2-4-1-3-7">
<p>
defsubr (&amp;Srun<sub>hooks</sub>);
defsubr (&amp;Srun<sub>hook</sub><sub>with</sub><sub>args</sub>);
defsubr (&amp;Srun<sub>hook</sub><sub>with</sub><sub>args</sub><sub>until</sub><sub>success</sub>);
defsubr (&amp;Srun<sub>hook</sub><sub>with</sub><sub>args</sub><sub>until</sub><sub>failure</sub>);
defsubr (&amp;Srun<sub>hook</sub><sub>wrapped</sub>);
defsubr (&amp;Sfetch<sub>bytecode</sub>);
defsubr (&amp;Sbacktrace<sub>debug</sub>);
defsubr (&amp;Sbacktrace);
defsubr (&amp;Sbacktrace<sub>frame</sub>);
defsubr (&amp;Sbacktrace<sub>eval</sub>);
defsubr (&amp;Sbacktrace_<sub>locals</sub>);
defsubr (&amp;Sspecial<sub>variable</sub><sub>p</sub>);
defsubr (&amp;Sfunctionp);
</p>
</div></li></ol></li></ol></li>

<li><a id="orgheadline54"></a>UI<br  /><div class="outline-text-5" id="text-2-2-4-2">
<p>
以下部分屬於使用者互動，在 repl 的層級暫不討論
</p>

<p>
<a href="command_loop_2%20(Lisp_Object%20ignore)">Bookmark: command<sub>loop</sub><sub>2</sub> (Lisp<sub>Object</sub> ignore)</a>
</p>

<p>
<a href="internal_condition_case%20(command_loop_1,%20Qerror,%20cmd_error);">Bookmark: internal<sub>condition</sub><sub>case</sub> (command<sub>loop</sub><sub>1</sub>, Qerror, cmd<sub>error</sub>);</a>
</p>
</div></li></ol>
</div>
</div>
</div>




<div id="outline-container-orgheadline81" class="outline-2">
<h2 id="orgheadline81"><span class="section-number-2">3</span> 從 mal 方找尋 emacs 方的對應元素</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">3.1</span> repl<sub>env</sub> =&gt; Vobarray</h3>
<div class="outline-text-3" id="text-3-1">
<p>
mal 在初始化的過程中，把 core.ns 的內容複製到了 repl<sub>env</sub> 當中，因此 repl<sub>env</sub> 才是真正意義上存放所有 symboe 的物件，core.ns 則類似於 initial<sub>obarray</sub>
</p>
</div>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">3.2</span> equal</h3>
<div class="outline-text-3" id="text-3-2">
<p>
嘗試載入 loadup.el 的過程中，第一個遇到的問題就是找不到這個算子。這個問題倒是好解決，因為 mal 本身已經定義了 "=" 算子；不過這倒是提供我們再一次審視 scanning / parsing 的流程
</p>
</div>

<div id="outline-container-orgheadline59" class="outline-4">
<h4 id="orgheadline59"><span class="section-number-4">3.2.1</span> emacs implementation</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
fns.c  中有如下定義：
</p>

<p>
<a href="DEFUN%20("equal",%20Fequal,%20Sequal,%202,%202,%200,">Bookmark: DEFUN ("equal", Fequal, Sequal, 2, 2, 0,</a>
</p>

<p>
<a href="%20%20defsubr%20(&amp;Sequal);">Bookmark:   defsubr (&amp;Sequal);</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline60" class="outline-4">
<h4 id="orgheadline60"><span class="section-number-4">3.2.2</span> mal implementation</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
core.js 中有如下定義：
</p>

<p>
<a href="var%20ns%20=%20{'type':%20types._obj_type,%20'=':%20types._equal_Q,">Bookmark: var ns = {'type': types.<sub>obj</sub><sub>type</sub>, '=': types.<sub>equal</sub><sub>Q</sub>,</a>
</p>

<p>
因此符號的代表字串 '=' ，以及對應的函數 _equal<sub>Q</sub> ，做為 hash 的一筆資料而存在於 ns 中
</p>

<p>
stepA<sub>mal.js</sub> 中有如下定義：
</p>

<p>
<a href="for%20(var%20n%20in%20core.ns)%20{%20repl_env.set(types._symbol(n),%20core.ns%5Bn%5D);%20}">Bookmark: for (var n in core.ns) { repl<sub>env.set</sub>(types.<sub>symbol</sub>(n), core.ns{n}); }</a>
</p>

<p>
ns 的資料再被逐筆的複製到 repl<sub>env</sub> 中
</p>
</div>
</div>
<div id="outline-container-orgheadline61" class="outline-4">
<h4 id="orgheadline61"><span class="section-number-4">3.2.3</span> 小結:  DEFUN/defsubr -&gt; core.ns</h4>
</div>
</div>
<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">3.3</span> let* / let</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Note that there are plenty of ways to make (GLOBAL) bindings: ‘defconst’, ‘defun’, ‘defvar’, 'let', ‘flet’, ‘labels’, ‘prog’, etc.
</p>

<p>
根據 <a href="https://www.emacswiki.org/emacs/DynamicBindingVsLexicalBinding">此文</a> , emacs 只有 dynamic binding ，也就是說所有符號共用一個資料結構來存放 ， 使得內層的函數/迴圈可以影響外層符號，不管這個符號背後是變數或函數。
</p>

<p>
根據這樣的邏輯，dynamic binding (ie emacs lisp) 在局部變數宣告時， 會先查找環境是否有同名的符號，若然則直接使用它，不在自己的 scope 再定義自己的符號； lexical binding (scheme?) 則無論如何都直接在自己的環境中， 為局部變數定義符號，並且優先查找。
</p>

<p>
let* 與 let 的不同之處在於，let 的 value 會在與 key 作 binding 前先求值， 因此當 local / global 有同名變數時， 會優先取 global 的值。
</p>

<p>
更精確的來說， let 會比 let* 多一個迴圈，先對所有的 value 進行 eval ； 後面的部分就都差不多
</p>
</div>

<div id="outline-container-orgheadline65" class="outline-4">
<h4 id="orgheadline65"><span class="section-number-4">3.3.1</span> emacs:</h4>
<div class="outline-text-4" id="text-3-3-1">
</div><ol class="org-ol"><li><a id="orgheadline63"></a>let*<br  /><div class="outline-text-5" id="text-3-3-1-1">
<p>
<a href="DEFUN%20("let*",%20FletX,%20SletX,%201,%20UNEVALLED,%200,">Bookmark: DEFUN ("let*", FletX, SletX, 1, UNEVALLED, 0,</a>
</p>
</div></li>

<li><a id="orgheadline64"></a>let<br  /><div class="outline-text-5" id="text-3-3-1-2">
<p>
<a href="DEFUN%20("let",%20Flet,%20Slet,%201,%20UNEVALLED,%200,">Bookmark: DEFUN ("let", Flet, Slet, 1, UNEVALLED, 0,</a>
</p>
</div></li></ol>
</div>

<div id="outline-container-orgheadline66" class="outline-4">
<h4 id="orgheadline66"><span class="section-number-4">3.3.2</span> mal:</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
最外層的環境為 repl<sub>env</sub> ，也就是 DEFUN / DEFVAR / DEFCONST 的作用域
</p>
</div>
</div>
